src/cf/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СерииНоменклатурыГарантии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СерииНоменклатурыГарантии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МиграцияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииСерийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОперацииСерийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииСерийНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Движение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СерииНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Рассчитывает максимальный номер серии который уже используется для вида номенклатуры
// или уже указан в ТаблицеЗначений "ТаблицаСерий"
//
// Параметры
//	ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - вид номенклатуры, для которого ищется номер серии    
//  ТаблицаСерий  - ТаблицаЗначений - таблица значений содержащая номера серий использованных на форме
//
// Возвращаемое значение:
//   ЗначениеКодаЧислом - Число - номер серии 
//
Функция ВычислитьМаксимальныйНомерСерии(Владелец, ШаблонСерииНоменклатуры=Неопределено)  Экспорт 
	
	СтрокаШаблона = "";
	Если ШаблонСерииНоменклатуры=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ШаблонСерииНоменклатуры) Тогда
		// 8 цифр
		ШаблонСерииНоменклатурыСтрокой = "########";
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Наименование
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец
		|	И СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 1, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 2, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 3, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 4, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 5, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 6, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 7, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, 8, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
		
	Иначе
		Для н=1 По СтрДлина(ШаблонСерииНоменклатуры) Цикл
			Символ = Сред(ШаблонСерииНоменклатуры, н, 1);
			Если Символ=СерииНоменклатурыУНФКлиентСервер.СимволЧисла() Тогда
				
				СтрокаУсловия = СтрШаблон("
				|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, %1, 1) В (""0"", ""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"")", Строка(н));
				
				СтрокаШаблона = СтрокаШаблона + СтрокаУсловия;
			Иначе
			
			СтрокаУсловия = СтрШаблон("
			|	И ПОДСТРОКА(СерииНоменклатуры.Наименование, %1, 1) Подобно ""_"" ", Строка(н));
			
			СтрокаШаблона = СтрокаШаблона + СтрокаУсловия;
				
			КонецЕсли;
		КонецЦикла;
		ШаблонСерииНоменклатурыСтрокой = Строка(ШаблонСерииНоменклатуры);
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Наименование
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец И
		|	СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ" + СтрокаШаблона + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование УБЫВ";
			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Количество()=0 Тогда
		ОписаниеТипаЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(8, 0, ДопустимыйЗнак.Неотрицательный));
		ЗначениеКодаЧислом = ОписаниеТипаЧисла.ПривестиЗначение(Выборка.Наименование);
	Иначе
		ЗначениеКодаЧислом = СерияЧислоПоШаблону(Выборка.Наименование, ШаблонСерииНоменклатурыСтрокой);
	КонецЕсли; 
	
	Возврат ЗначениеКодаЧислом;
	
КонецФункции

Функция СерияИзЧислаПоШаблону(СерияЧисло, ШаблонСерииНоменклатурыСтрокой, ДлинаЧисловойЧасти) Экспорт
	
	СерияДополнитьНулями = Строка(СерияЧисло);
	Для н=1 По ДлинаЧисловойЧасти - СтрДлина(СерияЧисло) Цикл
		СерияДополнитьНулями = "0"+СерияДополнитьНулями;
	КонецЦикла;
	
	СерияПоШаблону = "";
	НомерСимволаЧисла = 1;
	Для н=1 По СтрДлина(ШаблонСерииНоменклатурыСтрокой) Цикл
		Символ = Сред(ШаблонСерииНоменклатурыСтрокой, н, 1);
		Если Символ=СерииНоменклатурыУНФКлиентСервер.СимволЧисла() Тогда
			СерияПоШаблону = СерияПоШаблону + Сред(СерияДополнитьНулями,НомерСимволаЧисла,1);
			НомерСимволаЧисла = НомерСимволаЧисла+1;
		Иначе
			СерияПоШаблону = СерияПоШаблону + Сред(ШаблонСерииНоменклатурыСтрокой,н,1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СерияПоШаблону;
	
КонецФункции

Функция СерияЧислоПоШаблону(Серия, ШаблонСерииНоменклатурыСтрокой) Экспорт
	
	СерияИзЦифр = "";
	Для н=1 По СтрДлина(ШаблонСерииНоменклатурыСтрокой) Цикл
		Символ = Сред(ШаблонСерииНоменклатурыСтрокой,н,1);
		Если Символ=СерииНоменклатурыУНФКлиентСервер.СимволЧисла() Тогда
			СерияИзЦифр = СерияИзЦифр+Сред(Серия,н,1);
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	Возврат ОписаниеТипаЧисла.ПривестиЗначение(СерияИзЦифр);
	
КонецФункции

// Возвращает имена реквизитов, которые не должны отображаться в списке реквизитов обработки ГрупповоеИзменениеОбъектов
//
//	Возвращаемое значение:
//		Массив - массив имен реквизитов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("Номер");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

Функция СрокДействияГарантии(Серия, ДатаПроверки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерииНоменклатурыГарантии.Регистратор КАК Регистратор,
	|	Товары.ГарантийныйСрок КАК ГарантийныйСрокМесяцев,
	|	СерииНоменклатурыГарантии.ДатаСобытия КАК ДатаПродажи,
	|	РАЗНОСТЬДАТ(СерииНоменклатурыГарантии.ДатаСобытия, &ДатаПроверки, МЕСЯЦ) КАК ПрошлоМесяцев,
	|	ДОБАВИТЬКДАТЕ(СерииНоменклатурыГарантии.ДатаСобытия, МЕСЯЦ, Товары.ГарантийныйСрок) КАК ГарантияДо,
	|	Товары.ВыписыватьГарантийныйТалон КАК ВыписыватьГарантийныйТалон
	|ИЗ
	|	РегистрСведений.СерииНоменклатурыГарантии КАК СерииНоменклатурыГарантии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СерииНоменклатурыГарантии.Номенклатура = Товары.Ссылка
	|ГДЕ
	|	СерииНоменклатурыГарантии.Серия = &Серия
	|	И СерииНоменклатурыГарантии.Операция = &Операция
	|	И НЕ ТИПЗНАЧЕНИЯ(СерииНоменклатурыГарантии.Регистратор) = ТИП(Документ.ПриемИПередачаВРемонт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерииНоменклатурыГарантии.ДатаСобытия УБЫВ";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииСерийНоменклатуры.Расход);
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураВозврата = Новый Структура;
	Если Выборка.Следующий() Тогда
		Если Выборка.ГарантийныйСрокМесяцев > Выборка.ПрошлоМесяцев Тогда
			СтруктураВозврата.Вставить("Гарантия", Истина);
		Иначе
			СтруктураВозврата.Вставить("Гарантия", Ложь);
		КонецЕсли;
		СтруктураВозврата.Вставить("СрокДействияГарантии",Выборка.ГарантияДо);
		//СтруктураВозврата.Вставить("НомерГарантии",Выборка.НомерДокументаПродажи);
		СтруктураВозврата.Вставить("ДокументПродажи",Выборка.Регистратор);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура обработчик события ОбработкаПолученияДанныхВыбора.
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец")
		И ЗначениеЗаполнено(Параметры.Отбор.Владелец)
		И НЕ Параметры.Отбор.Владелец.ИспользоватьСерииНоменклатуры Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по сериям'");
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ТипЗнч(Данные) = Тип("Структура") 
		И Данные.Свойство("Ссылка") Тогда
		
		Ссылка = Данные.Ссылка;
		
		ДатаПроизводства = "";
		ГоденДо = "";
		
		Если ЗначениеЗаполнено(Ссылка.ДатаПроизводства) Тогда
			ДатаПроизводства = Формат(Ссылка.ДатаПроизводства, "ДФ=дд.ММ.гггг")
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ГоденДо) Тогда
			ГоденДо = Формат(Ссылка.ГоденДо, "ДФ=дд.ММ.гггг");
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ДатаПроизводства) И ЗначениеЗаполнено(ГоденДо) Тогда
			Представление = СтрШаблон(НСтр("ru='%1 от %2 до %3'"), Ссылка.Наименование, ДатаПроизводства, ГоденДо);
		ИначеЕсли ЗначениеЗаполнено(ДатаПроизводства) Тогда
			Представление = СтрШаблон(НСтр("ru='%1 от %2'"), Ссылка.Наименование, ДатаПроизводства);
		ИначеЕсли ЗначениеЗаполнено(ГоденДо) Тогда
			Представление = СтрШаблон(НСтр("ru='%1 до %2'"), Ссылка.Наименование, ГоденДо);
		Иначе
			Представление = СтрШаблон(НСтр("ru='%1'"), Ссылка.Наименование);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
